//////////////////////////////////////////////////////////////////////////////
////////////     Create by S.P.S 2012(c)              		 /////////////
//////////////////////////////////////////////////////////////////////////////
////////////                                                     /////////////
////////////     Инициализация библиотеки для сдвиговых          /////////////
////////////     регистров 74HC164.    	                         /////////////
////////////                                                     /////////////
//////////////////////////////////////////////////////////////////////////////
////////////                                                     /////////////
////////////     Тут устанавливается длинна буфера отправки,     /////////////
////////////     задействованные регистры, и используемые пины	 /////////////
////////////                                                     /////////////
//////////////////////////////////////////////////////////////////////////////
////////////                                                     /////////////
////////////     Расположение: в сегменте   .DSEG                /////////////
////////////                                                     /////////////
//////////////////////////////////////////////////////////////////////////////


	.equ 	bufsize = 3		; размер буфера отправки

	.equ	shport 	= PORTB	; PORTx потра к которому подключен сдвиговый регистр
	.equ	shpin	= PINB	; PINx потра к которому подключен сдвиговый регистр
	.equ	shddr	= DDRB	; DDRx потра к которому подключен сдвиговый регистр
	.equ 	shbit	= 2		; Вывод данных
	.equ 	clbit	= 0		; Стробирующий вывод


	.def	BTCOUNT  = R17	; Счетчик бит 		0..7
	.def	BUFCOUNT = R18	; Счетчик буфера 	0..bufsize
	.def	BUFREG 	 = R19	; промежуточный буфер-регистр

	 
	 sBUF: 	.BYTE bufsize	; sBUF - буфера отправки
							; Сюда ложим то что хотим отправить


/*////////////////////////////////////////////////////////////////////////////
////////////                                                     /////////////
////////////     Справочная табличка по размерам оперативки      /////////////
////////////                                                     /////////////
//////////////////////////////////////////////////////////////////////////////
Device         			SRAM (Bytes)

AT90CAN128 Automotive     4096
AT90PWM2                  512
AT90PWM3                  512
ATmega128                 4096
ATmega1280                8192
ATmega1281                8192
ATmega16                  1024
ATmega162                 1024
ATmega165                 1024
ATmega165P                1024
ATmega168                 1024
ATmega168 Automotive      1024
ATmega169                 1024
ATmega169P                1024
ATmega2560                8192
ATmega2561                8192
ATmega32                  2048
ATmega325                 2048
ATmega3250                2048
ATmega329                 2048
ATmega3290                2048
ATmega406                 2048
ATmega48                  512
ATmega48 Automotive       512
ATmega64                  4096
ATmega640                 8192
ATmega644                 4096
ATmega645                 4096
ATmega6450                4096
ATmega649                 4096
ATmega6490                4096
ATmega8                   1024
ATmega8515                512
ATmega8535                512
ATmega88                  1024
ATmega88 Automotive       1024
ATtiny11                   --
ATtiny12                   --
ATtiny13                64B + 32 reg
ATtiny15L                  --
ATtiny2313                128
ATtiny24                  128
ATtiny25                  128
ATtiny25 Automotive       128
ATtiny26                  128
ATtiny28L                  32
ATtiny44                  256
ATtiny45                  256
ATtiny45 Automotive       128
ATtiny84                  512
ATtiny85                  512
ATtiny85 Automotive       128
*/////////////////////////////////////////////////////////////////////////////
